ravynsoft/ravynos/Kernel/Extensions/IOUSBFamily/src/IOUSBPipe.cpp
    err = _controller->OpenPipe(_address, speed, &_endpoint);
    
    if ((err == kIOReturnNoBandwidth) && (_endpoint.transferType == kUSBIsoc))
    {
		USBError(1,"There is not enough USB isochronous bandwidth to allow the device \"%s\" at location 0x%x to function in its current configuration (requested %d bytes for endpoint 0x%x )", _DEVICE ? _DEVICE->getName() : "Unnamed", (uint32_t)_LOCATIONID, _endpoint.maxPacketSize, ed->bEndpointAddress);
		
		_endpoint.maxPacketSize = 0;
		USBLog(6, "IOUSBPipe[%p]::InitToEndpoint  can't get bandwidth for isoc pipe - creating 0 bandwidth pipe", this);
		err = _controller->OpenPipe(_address, speed, &_endpoint);
    }
    
    if ( err != kIOReturnSuccess)
    {
        USBLog(3,"IOUSBPipe[%p]::InitToEndpoint Could not create pipe for endpoint (Addr: %d, numb: %d, type: %d).  Error 0x%x", this, _address, _endpoint.number, _endpoint.transferType, err);
        return false;
    }
    
	USBTrace_End( kUSBTPipe, kTPPipeInitToEndpoint, (uintptr_t)this, 0, 0, 0);
    
    return true;
}



//================================================================================================
//
//   ToEndpoint
//
//================================================================================================
//
IOUSBPipe *
IOUSBPipe::ToEndpoint(const IOUSBEndpointDescriptor *ed, IOUSBDevice * device, IOUSBController *controller, IOUSBInterface * interface)
{
	IOUSBPipe *	me = new IOUSBPipe;
   
    USBLog(1, "IOUSBPipe::ToEndpoint, obsolete method 3 called");
	USBLog(6, "IOUSBPipe[%p]::ToEndpoint device %p(%s), interface %p, ep: 0x%x,0x%x,%d,%d", me, device, device->getName(), interface, ed->bEndpointAddress, ed->bmAttributes, ed->wMaxPacketSize, ed->bInterval);
	
	if ( me && interface)
	{
		// If we allow out of spec MPS (with a property) set a flag
		me->_OUTOFSPECMPSOK = ( interface->getProperty(kUSBOutOfSpecMPSOK) == kOSBooleanTrue );
		if (me->_OUTOFSPECMPSOK)
		{
			USBLog(6,"IOUSBPipe[%p]::ToEndpoint Device reports Out of spec MPS property and is TRUE", me);
		}
	}

	if ( !me->InitToEndpoint(ed, device->GetSpeed(), device->GetAddress(), controller, device, interface) ) 
    {
        me->release();
        return NULL;
    }

	if ( me && me->_expansionData && me->_INTERFACE )
    {
        // If our interface has the CrossEndianCompatible property, set our boolean
        me->_CROSSENDIANCOMPATIBLE = ( me->_INTERFACE->getProperty(kIOUserClientCrossEndianCompatibleKey) == kOSBooleanTrue);
    }
	
    return me;
}



//================================================================================================
//
//   free
//
//================================================================================================
//
void 
IOUSBPipe::free()
{

    //  This needs to be the LAST thing we do, as it disposes of our "fake" member
    //  variables.
    //
    if (_expansionData)
    {
        IOFree(_expansionData, sizeof(ExpansionData));
        _expansionData = NULL;
    }

    super::free();
}


#pragma mark IOUSBPipe State

//================================================================================================
//
//   Abort
//
//================================================================================================
//
IOReturn 
IOUSBPipe::Abort(void)
{
	IOUSBPipeV2		*pipev2 = OSDynamicCast(IOUSBPipeV2, this);
	
	if ( pipev2 )
	{
		USBLog(5,"IOUSBPipe[%p]::AbortPipe  calling through to IOUSBPipeV2::Abort(kUSBAllStreams)",this);
		return pipev2->Abort(kUSBAllStreams);
	}
	else
	{
		USBLog(5,"IOUSBPipe[%p]::AbortPipe",this);
		if (_CORRECTSTATUS != 0)
		{
			USBLog(2, "IOUSBPipe[%p]::Abort setting status to 0", this);
		}
		_CORRECTSTATUS = 0;
		return _controller->AbortPipe(_address, &_endpoint);
	}
}


//================================================================================================
//
//   Reset
//
//================================================================================================
//
IOReturn 
IOUSBPipe::Reset(void)
{
    USBLog(7,"IOUSBPipe[%p]::Reset",this);
    if (_CORRECTSTATUS != 0)
	{
        USBLog(2, "IOUSBPipe[%p]::Reset setting status to 0", this);
	}
    _CORRECTSTATUS = 0;
    return _controller->ResetPipe(_address, &_endpoint);
}


//================================================================================================
//
//   ClosePipe
//
//================================================================================================
//
IOReturn 
IOUSBPipe::ClosePipe(void)
{
    // This method should be called by the provider of the IOUSBPipe (IOUSBInterface) right before it
    // releases the pipe.  We do it here instead of in the free method (as was previosuly done) because
    // _controller->ClosePipe() will end up deleting the endpoint, which is necessary.  If we left this
    // call in the free method then this wouldn't get called if someone had an extra retain on the pipe object.

    return _controller->ClosePipe(_address, &_endpoint);
}


//================================================================================================
//
//   ClearPipeStall
//
//================================================================================================
//
IOReturn 
IOUSBPipe::ClearStall(void)
{
    return ClearPipeStall(false);
}


IOReturn 
IOUSBPipe::ClearPipeStall(bool withDeviceRequest)
{
    IOReturn	err;
    
    USBLog(5,"IOUSBPipe[%p]::ClearPipeStall",this);
	
	if (_expansionData == NULL)
		return kIOReturnNoDevice;
	
    USBTrace_Start( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, _endpoint.number , _endpoint.transferType );

    if (_CORRECTSTATUS != 0)
	{
        USBLog(2, "IOUSBPipe[%p]::ClearPipeStall setting status to 0", this);
        USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, _endpoint.number , 1 );
	}
	
    _CORRECTSTATUS = 0;
    
    if ( _endpoint.transferType == kUSBIsoc )
    {
        USBLog(2, "IOUSBPipe[%p]::ClearPipeStall Isoch pipes never stall.  Returning success", this);
        USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, _endpoint.number , 2 );
        return kIOReturnSuccess;
    }
    
