ravynsoft/ravynos/Kernel/Extensions/IOUSBFamily/src/IOUSBPipe.cpp
	if ( !_DEVICE )
	{
        USBLog(2, "IOUSBPipe[%p]::ClearPipeStall  no _DEVICE", this);
        USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, _endpoint.number , 3 );
        return kIOReturnNotPermitted;
	}
	
	if ( _DEVICE->isInactive() )
	{
        USBLog(6, "IOUSBPipe[%p]::ClearPipeStall  _DEVICE is inActive(), so returning success", this);
        USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, _endpoint.number , 4 );
        return kIOReturnSuccess;
	}
	
	// Make sure we don't go away and our device doesn't go away
	retain();
	_DEVICE->retain();
	
    err = _controller->ClearPipeStall(_address, &_endpoint);
    USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, err , 5 );
	
	if (err == kIOUSBClearPipeStallNotRecursive)
	{
		USBLog(1,"IOUSBPipe[%p]::ClearPipeStall - tried to call recursively, err = %p", this, (void*)err);
        USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, err , 6 );
	}
	
	
    if ((_DEVICE->GetSpeed() == kUSBDeviceSpeedHigh) || (_DEVICE->GetSpeed() == kUSBDeviceSpeedSuper))
    {
		USBLog(6,"IOUSBPipe[%p]::ClearPipeStall - HiSpeed or SuperSpeedDevice, no clear TT needed",this);
        USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, _endpoint.number , 7 );
    }
    else if (!err && ( (_endpoint.transferType == kUSBBulk) || (_endpoint.transferType == kUSBControl) ) )
    {
		USBLog(5,"IOUSBPipe[%p]::ClearPipeStall Bulk or Control endpoint, clear TT",this);
		// Now, we need to tell our parent to issue a port reset to our port.  Our parent is an IOUSBDevice
		// that has a hub driver attached to it.  However, we don't know what kind of driver that is, so we
		// just send a message to all the clients of our parent.  The hub driver will be the only one that
		// should do anything with that message.
		//
		if ( _expansionData && _DEVICE && _DEVICE->_expansionData && _DEVICE->_expansionData->_usbPlaneParent )
		{
			IOUSBHubPortClearTTParam        params;
			UInt8						deviceAddress;		//<<0
			UInt8						endpointNum;		//<<8
			UInt8						endpointType;		//<<16 // As split transaction. 00 Control, 10 Bulk
			UInt8						in;					//<<24 // Direction, 1 = IN, 0 = OUT};
			IOUSBDevice *				usbParent = _DEVICE->_expansionData->_usbPlaneParent;
			
			if (usbParent)
			{
				usbParent->retain();
				params.portNumber = _DEVICE->_expansionData->_portNumber;
				deviceAddress = _DEVICE->GetAddress();
				endpointNum = _endpoint.number;
				if (_endpoint.transferType == kUSBControl)
				{
					endpointType = 0;	// As split transaction. 00 Control, 10 Bulk
					in = 0;				// Direction, 1 = IN, 0 = OUT, not used for control
				}
				else
				{
					endpointType = 2;		// As split transaction. 00 Control, 10 Bulk
					if (_endpoint.direction == kUSBIn)
					{
						in = 1;			// Direction, 1 = IN, 0 = OUT, not used for control
					}
					else
					{
						in = 0;
					}
				}
				params.options = deviceAddress + (endpointNum <<8) + (endpointType << 16) + (in << 24);
				
				
				USBLog(6, "IOUSBPipe[%p]::ClearPipeStall  calling device messageClients (kIOUSBMessageHubPortClearTT) with options: 0x%x", this, (uint32_t)params.options);
                USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, params.portNumber, params.options , 8 );
				(void) usbParent->messageClients(kIOUSBMessageHubPortClearTT, &params, sizeof(params));
				usbParent->release();
			}
		}
        else
        {
            USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, _endpoint.number , 9 );

        }
    }
    else
    {
		USBLog(5,"IOUSBPipe[%p]::ClearPipeStall Int or Isoc endpoint, don't clear TT (or err: 0x%x)",this, err);
    }
    
    if (!err && withDeviceRequest)
    {
		IOUSBDevRequest	request;
        IOUSBCompletion	tap;
		
		// The action of IOUSBSyncCompletion will tell the USL that this is a sync transfer
		//
        tap.target = NULL;
        tap.action = &IOUSBSyncCompletion;
        tap.parameter = &request.wLenDone;
		
        USBLog(7,"IOUSBPipe[%p]::ClearPipeStall - sending request to the device", this);
		request.bmRequestType = USBmakebmRequestType(kUSBOut, kUSBStandard, kUSBEndpoint);
		request.bRequest = kUSBRqClearFeature;
		request.wValue = kUSBFeatureEndpointStall;
		request.wIndex = _endpoint.number | ((_endpoint.direction == kUSBIn) ? 0x80 : 0);
		request.wLenDone = request.wLength = 0;
		request.pData = NULL;
		
		// send the request to pipe zero
		err = _controller->DeviceRequest(&request, &tap, _address, 0, kUSBDefaultControlNoDataTimeoutMS, kUSBDefaultControlCompletionTimeoutMS);
        USBTrace( kUSBTPipe, kTPPipeClearPipeStall, (uintptr_t)this, _address, err , 10 );
		
    }
	
	if (_expansionData && _DEVICE)
		_DEVICE->release();
	
	release();

    USBTrace_End( kUSBTPipe, kTPPipeClearPipeStall, _address, _endpoint.number , _endpoint.transferType, err );
    return err;
}


//================================================================================================
//
//   SetPipePolicy
//
//================================================================================================
//
IOReturn
IOUSBPipe::SetPipePolicy(UInt16 maxPacketSize, UInt8 maxInterval)
{
	UInt8		oldInterval = _endpoint.interval;
	UInt16		oldsize = _endpoint.maxPacketSize;
    IOReturn 	err = kIOReturnSuccess;
	bool		change = false;
    
	USBLog(6, "IOUSBPipe[%p]::SetPipePolicy (addr %d:%d dir: %d, type: %d) - maxPacketSize: %d, maxInterval: %d", this, _address, _endpoint.number, _endpoint.direction, _endpoint.transferType, maxPacketSize, maxInterval);
	
    switch (_endpoint.transferType)
    {
		case kUSBIsoc:
			if (maxPacketSize <= _INTERFACE->CalculateFullMaxPacketSize((IOUSBEndpointDescriptor*)_descriptor, NULL))
			{
				USBLog(6, "IOUSBPipe[%p]::SetPipePolicy - trying to change isoch pipe from %d to %d bytes", this, oldsize, maxPacketSize);
				_endpoint.maxPacketSize = maxPacketSize;
				
				// OpenPipe with Isoch pipes which already exist will try to change the maxpacketSize in the pipe.
				// the speed param below is actually unused for Isoc pipes
				err = _controller->OpenPipe(_address, _SPEED, &_endpoint);
				if (err)
				{
					USBLog(2, "IOUSBPipe[%p]::SetPipePolicy - new OpenPipe failed with 0x%x (%s) - returning old settings", this, err, USBStringFromReturn(err));
					_endpoint.maxPacketSize = oldsize;
				}
			}
			else
			{
				USBLog(2, "IOUSBPipe[%p]::SetPipePolicy - requested size (%d) larger than maxPacketSize in descriptor (%d)", this, maxPacketSize, _endpoint.maxPacketSize);
				err = kIOReturnBadArgument;
			}
			break;
			
