ravynsoft/ravynos/Kernel/Extensions/IOUSBFamily/src/IOUSBPipe.cpp
		case kUSBInterrupt:
			if ( maxInterval == 0 )
			{
				USBLog(2, "IOUSBPipe[%p]::SetPipePolicy - requested a maxInterval of 0, which is not legal", this);
				err = kIOReturnBadArgument;
			}
			else
			{
				if ( maxInterval != _endpoint.interval )
				{    
					USBLog(3, "IOUSBPipe[%p]::SetPipePolicy - trying to change interrupt pollingRate from %d to %d", this, oldInterval, maxInterval);
					_endpoint.interval = maxInterval;
					change = true;
				}
				else
				{
					USBLog(6, "IOUSBPipe[%p]::SetPipePolicy - requested maxInterval size is the same as before", this);
				}
				
				if (maxPacketSize <= _INTERFACE->CalculateFullMaxPacketSize((IOUSBEndpointDescriptor*)_descriptor, NULL))
				{
					USBLog(3, "IOUSBPipe[%p]::SetPipePolicy - trying to change interrupt maxPacketSize from %d to %d bytes", this, oldsize, maxPacketSize);
					_endpoint.maxPacketSize = maxPacketSize;
					change = true;
				}
				else
				{
					USBLog(2, "IOUSBPipe[%p]::SetPipePolicy - requested size (%d) larger than maxPacketSize in descriptor (%d)", this, maxPacketSize, _endpoint.maxPacketSize);
					err = kIOReturnBadArgument;
					change = false;
				}
				
				if ( change  )
				{
					err = _controller->OpenPipe(_address, _SPEED, &_endpoint);
					if (err)
					{
						USBLog(2, "IOUSBPipe[%p]::SetPipePolicy - changing parameters failed with err = 0x%x (%s), trying to restore old settings", this, err, USBStringFromReturn(err));
						_endpoint.interval = oldInterval;
						_endpoint.maxPacketSize = oldsize;
						
						err = _controller->OpenPipe(_address, _SPEED, &_endpoint);
						if (err)
						{
							USBLog(2, "IOUSBPipe[%p]::SetPipePolicy - changing parameters failed second time with error 0x%x (%s)", this, err, USBStringFromReturn(err));
						}
					}
				}
			}
			break;
			
		default:
			USBLog(2, "IOUSBPipe[%p]::SetPipePolicy - wrong type of pipe - returning kIOReturnBadArgument", this);
			err = kIOReturnBadArgument;
    }
	
    return err;
}


#pragma mark Bulk Read

//================================================================================================
//
//   Read (Bulk)
//
//================================================================================================
//
IOReturn 
IOUSBPipe::Read(IOMemoryDescriptor *buffer, IOUSBCompletion *completion, IOByteCount *bytesRead)
{
    USBLog(7, "IOUSBPipe[%p]::Read #1", this);
    return Read(buffer, 0, 0, completion, bytesRead);
}


IOReturn 
IOUSBPipe::Read(IOMemoryDescriptor *buffer, UInt32 noDataTimeout, UInt32 completionTimeout, IOUSBCompletion *completion, IOByteCount *bytesRead)
{
    USBLog(7, "IOUSBPipe[%p]::Read #2", this);
	
    // Validate that there is a buffer so that we can call getLength on it
    if (!buffer)
    {
        USBLog(5, "IOUSBPipe[%p]::Read - NULL buffer!", this);
		return kIOReturnBadArgument;
    }
    
    return Read(buffer, noDataTimeout, completionTimeout, buffer->getLength(), completion, bytesRead);
}


IOReturn 
IOUSBPipe::Read(IOMemoryDescriptor *buffer, UInt32 noDataTimeout, UInt32 completionTimeout, IOByteCount reqCount, IOUSBCompletion *completion, IOByteCount *bytesRead)
{
	IOUSBPipeV2		*pipev2 = OSDynamicCast(IOUSBPipeV2, this);
	
	if ( pipev2 )
	{
		return pipev2->Read(0, buffer, noDataTimeout, completionTimeout, reqCount, completion, bytesRead);
	}
	else
	{
		IOReturn	err = kIOReturnSuccess;
		
		USBLog(7, "IOUSBPipe[%p]::Read #3 (addr %d:%d type %d) - reqCount = %qd", this, _address, _endpoint.number , _endpoint.transferType, (uint64_t)reqCount);
		USBTrace_Start( kUSBTPipe, kTPBulkPipeRead, _address, _endpoint.number , _endpoint.transferType, reqCount );
		
		if ((_endpoint.transferType != kUSBBulk) && (noDataTimeout || completionTimeout))
		{
			USBLog(5, "IOUSBPipe[%p]::Read - bad arguments:  (EP type: %d != kUSBBulk(%d)) && ( dataTimeout: %d || completionTimeout: %d)", this, _endpoint.transferType, kUSBBulk, (uint32_t)noDataTimeout, (uint32_t)completionTimeout);
			return kIOReturnBadArgument;
		}
		
		if (!buffer || (buffer->getLength() < reqCount))
		{
			USBLog(5, "IOUSBPipe[%p]::Write - bad buffer: (buffer %p) || ( length %qd < reqCount %qd)", this, buffer, buffer ? (uint64_t)buffer->getLength() : 0, (uint64_t)reqCount);
			return kIOReturnBadArgument;
		}
		
		if (_CORRECTSTATUS == kIOUSBPipeStalled)
		{
			USBLog(2, "IOUSBPipe[%p]::Read - invalid read on a stalled pipe", this);
			return kIOUSBPipeStalled;
		}
		
		if (completion == NULL)
		{
			// put in our own completion routine if none was specified to
			// fake synchronous operation
			IOUSBCompletion	tap;
			
			if (bytesRead)
				*bytesRead = reqCount;
			
			// The action of IOUSBSyncCompletion will tell the USL that this is a sync transfer
			//
			tap.target = NULL;
			tap.action = &IOUSBSyncCompletion;
			tap.parameter = bytesRead;
			
			err = _controller->Read(buffer, _address, &_endpoint, &tap, noDataTimeout, completionTimeout, reqCount);
			if (err != kIOReturnSuccess)
			{
				// any err coming back in the callback indicates a stalled pipe
            if (err && (err != kIOUSBTransactionTimeout) && (err != kIOReturnAborted))
				{
					USBLog(2, "IOUSBPipe[%p]::Read(sync)  returned 0x%x (%s) - stalling pipe", this, err, USBStringFromReturn(err));
					_CORRECTSTATUS = kIOUSBPipeStalled;
				}
			}
		}
		else
		{
			if (completion->action == NULL)
			{
				USBLog(1, "IOUSBPipe[%p]::Read - completion has NULL action - returning kIOReturnBadArgument(%p)", this, (void*)kIOReturnBadArgument);
				USBTrace(kUSBTPipe,  kTPBulkPipeRead, (uintptr_t)this, kIOReturnBadArgument, 0, 1 );
				return kIOReturnBadArgument;
			}
			err = _controller->Read(buffer, _address, &_endpoint, completion, noDataTimeout, completionTimeout, reqCount);
		}
		
		if (err == kIOUSBPipeStalled)
		{
			USBLog(2, "IOUSBPipe[%p]::Read  - controller returned stalled pipe, changing status", this);
			_CORRECTSTATUS = kIOUSBPipeStalled;
		}
		
 		if ( err == kIOUSBTransactionTimeout && _endpoint.transferType != kUSBInterrupt )
		{
			USBLog(1, "IOUSBPipe[%p]::Read - Location: 0x%x returned a kIOUSBTransactionTimeout", this, (uint32_t)_DEVICE->_expansionData->_locationID);
		}
		
		USBTrace_End( kUSBTPipe, kTPBulkPipeRead, (uintptr_t)this, _address, _endpoint.number, err);
		
		return(err);
	}
}

IOReturn
IOUSBPipe::Read(IOMemoryDescriptor *buffer, UInt32 noDataTimeout, UInt32 completionTimeout, IOByteCount reqCount, IOUSBCompletionWithTimeStamp *completionWithTimeStamp, IOByteCount *bytesRead)
{
    IOReturn                err = kIOReturnSuccess;
    IOUSBControllerV2  *    controllerV2;
    
